Revit 2015 API
BoundarySegment Members
The BoundarySegment type exposes the following members.
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Curve
Get the curve that is formed by the element that defines the edge of this area.
Document
Provides the document in which the element that created this segment resides.
Element
Retrieve the element that is responsible for producing this boundary segment.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
See Also
BoundarySegment Class
Autodesk.Revit.DB.Mechanical Namespace